nxp-mcuxpresso/mcux-sdk/devices/MKE13Z7/MKE13Z7.h
#define TSI_DATA_SWTS_MASK                       (0x400000U)
#define TSI_DATA_SWTS_SHIFT                      (22U)
/*! SWTS - Software Trigger Start
 *  0b0..No effect.
 *  0b1..Start a scan.
 */
#define TSI_DATA_SWTS(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_DATA_SWTS_SHIFT)) & TSI_DATA_SWTS_MASK)

#define TSI_DATA_DMAEN_MASK                      (0x800000U)
#define TSI_DATA_DMAEN_SHIFT                     (23U)
/*! DMAEN - DMA Transfer Enabled
 *  0b0..Interrupt is selected when the interrupt enable bit is set and the corresponding TSI events assert.
 *  0b1..DMA transfer request is selected when the interrupt enable bit is set and the corresponding TSI events assert.
 */
#define TSI_DATA_DMAEN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_DATA_DMAEN_SHIFT)) & TSI_DATA_DMAEN_MASK)

#define TSI_DATA_TSICH_MASK                      (0xF8000000U)
#define TSI_DATA_TSICH_SHIFT                     (27U)
/*! TSICH - TSICH
 *  0b00000..For self-cap mode: Channel 0.
 *  0b00001..For self-cap mode: Channel 1.
 *  0b00010..For self-cap mode: Channel 2.
 *  0b00011..For self-cap mode: Channel 3.
 *  0b00100..For self-cap mode: Channel 4.
 *  0b00101..For self-cap mode: Channel 5.
 *  0b00110..For self-cap mode: Channel 6.
 *  0b00111..For self-cap mode: Channel 7.
 *  0b01000..For self-cap mode: Channel 8.
 *  0b01001..For self-cap mode: Channel 9.
 *  0b01010..For self-cap mode: Channel 10.
 *  0b01011..For self-cap mode: Channel 11.
 *  0b01100..For self-cap mode: Channel 12.
 *  0b01101..For self-cap mode: Channel 13.
 *  0b01110..For self-cap mode: Channel 14.
 *  0b01111..For self-cap mode: Channel 15.
 *  0b10000..For self-cap mode: Channel 16.
 *  0b10001..For self-cap mode: Channel 17.
 *  0b10010..For self-cap mode: Channel 18.
 *  0b10011..For self-cap mode: Channel 19.
 *  0b10100..For self-cap mode: Channel 20.
 *  0b10101..For self-cap mode: Channel 21.
 *  0b10110..For self-cap mode: Channel 22.
 *  0b10111..For self-cap mode: Channel 23.
 *  0b11000..For self-cap mode: Channel 24.
 */
#define TSI_DATA_TSICH(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_DATA_TSICH_SHIFT)) & TSI_DATA_TSICH_MASK)
/*! @} */

/*! @name TSHD - TSI Threshold Register */
/*! @{ */

#define TSI_TSHD_THRESL_MASK                     (0xFFFFU)
#define TSI_TSHD_THRESL_SHIFT                    (0U)
/*! THRESL - TSI Wakeup Channel Low-threshold
 */
#define TSI_TSHD_THRESL(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_TSHD_THRESL_SHIFT)) & TSI_TSHD_THRESL_MASK)

#define TSI_TSHD_THRESH_MASK                     (0xFFFF0000U)
#define TSI_TSHD_THRESH_SHIFT                    (16U)
/*! THRESH - TSI Wakeup Channel High-threshold
 */
#define TSI_TSHD_THRESH(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_TSHD_THRESH_SHIFT)) & TSI_TSHD_THRESH_MASK)
/*! @} */

/*! @name MODE - TSI MODE Register */
/*! @{ */

#define TSI_MODE_S_NOISE_MASK                    (0x1U)
#define TSI_MODE_S_NOISE_SHIFT                   (0U)
/*! S_NOISE - S_NOISE
 *  0b0..noise cancellation off.
 *  0b1..noise cancellation on.
 */
#define TSI_MODE_S_NOISE(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_NOISE_SHIFT)) & TSI_MODE_S_NOISE_MASK)

#define TSI_MODE_MODE_MASK                       (0x2U)
#define TSI_MODE_MODE_SHIFT                      (1U)
/*! MODE - MODE
 *  0b0..self-cap mode.
 *  0b1..mutual-cap mode.
 */
#define TSI_MODE_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_MODE_MODE_SHIFT)) & TSI_MODE_MODE_MASK)

#define TSI_MODE_SETCLK_MASK                     (0x60U)
#define TSI_MODE_SETCLK_SHIFT                    (5U)
/*! SETCLK - SETCLK
 *  0b00..20.72MHz.
 *  0b01..16.65MHz.
 *  0b10..13.87MHz.
 *  0b11..11.91MHz.
 */
#define TSI_MODE_SETCLK(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_MODE_SETCLK_SHIFT)) & TSI_MODE_SETCLK_MASK)

#define TSI_MODE_S_XCH_MASK                      (0x7000U)
#define TSI_MODE_S_XCH_SHIFT                     (12U)
/*! S_XCH - S_XCH
 *  0b000..1/16.
 *  0b001..1/8.
 *  0b010..1/4.
 *  0b011..1/2.
 *  0b100..NA.
 *  0b101..NA.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MODE_S_XCH(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_XCH_SHIFT)) & TSI_MODE_S_XCH_MASK)

#define TSI_MODE_S_XIN_MASK                      (0x40000U)
#define TSI_MODE_S_XIN_SHIFT                     (18U)
/*! S_XIN - S_XIN
 *  0b0..1/8.
 *  0b1..1/4.
 */
#define TSI_MODE_S_XIN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_XIN_SHIFT)) & TSI_MODE_S_XIN_MASK)

#define TSI_MODE_S_CTRIM_MASK                    (0x380000U)
#define TSI_MODE_S_CTRIM_SHIFT                   (19U)
/*! S_CTRIM - Capacitor trim setting
 *  0b000..Ctrim=2.5p.
 *  0b001..Ctrim=5.0p.
 *  0b010..Ctrim=7.5p.
 *  0b011..Ctrim=10p.
 *  0b100..Ctrim=12.5p.
 *  0b101..Ctrim=15p.
 *  0b110..Ctrim=17.5p.
 *  0b111..Ctrim=20p.
 */
#define TSI_MODE_S_CTRIM(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_CTRIM_SHIFT)) & TSI_MODE_S_CTRIM_MASK)

#define TSI_MODE_S_SEN_MASK                      (0x400000U)
#define TSI_MODE_S_SEN_SHIFT                     (22U)
/*! S_SEN - S_SEN
 *  0b0..Sensitivity boost off.
 *  0b1..Sensitivity boost on.
 */
#define TSI_MODE_S_SEN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_SEN_SHIFT)) & TSI_MODE_S_SEN_MASK)

#define TSI_MODE_S_W_SHIELD_MASK                 (0x3800000U)
#define TSI_MODE_S_W_SHIELD_SHIFT                (23U)
/*! S_W_SHIELD - S_W_SHIELD
 */
#define TSI_MODE_S_W_SHIELD(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_W_SHIELD_SHIFT)) & TSI_MODE_S_W_SHIELD_MASK)

#define TSI_MODE_S_XDN_MASK                      (0x70000000U)
#define TSI_MODE_S_XDN_SHIFT                     (28U)
/*! S_XDN - S_XDN
 *  0b000..1/16.
 *  0b001..1/8.
 *  0b010..1/4.
 *  0b011..1/2.
 *  0b100..NA.
 *  0b101..NA.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MODE_S_XDN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_XDN_SHIFT)) & TSI_MODE_S_XDN_MASK)
/*! @} */

/*! @name MUL0 - TSI MUTUAL-CAP Register 0 */
/*! @{ */

#define TSI_MUL0_M_SEL_RX_MASK                   (0x7U)
#define TSI_MUL0_M_SEL_RX_SHIFT                  (0U)
/*! M_SEL_RX - M_SEL_RX
 *  0b000..select channel 6 as rx6.
 *  0b001..select channel 7 as rx7.
 *  0b010..select channel 8 as rx8.
 *  0b011..select channel 9 as rx9.
 *  0b100..select channel 10 as rx10.
 *  0b101..select channel 11 as rx11.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MUL0_M_SEL_RX(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_SEL_RX_SHIFT)) & TSI_MUL0_M_SEL_RX_MASK)

#define TSI_MUL0_M_SEL_TX_MASK                   (0x70U)
#define TSI_MUL0_M_SEL_TX_SHIFT                  (4U)
/*! M_SEL_TX - M_SEL_TX
 *  0b000..select channel 0 as tx0.
 *  0b001..select channel 1 as tx1.
 *  0b010..select channel 2 as tx2.
 *  0b011..select channel 3 as tx3.
 *  0b100..select channel 4 as tx4.
 *  0b101..select channel 5 as tx5.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MUL0_M_SEL_TX(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_SEL_TX_SHIFT)) & TSI_MUL0_M_SEL_TX_MASK)

#define TSI_MUL0_M_SEN_RES_MASK                  (0xF00U)
#define TSI_MUL0_M_SEN_RES_SHIFT                 (8U)
/*! M_SEN_RES - M_SEN_RES
 *  0b0000..2.5k.
 *  0b0001..5k.
 *  0b0010..7.5k.
 *  0b0011..10k.
 *  0b0100..12.5k.
 *  0b0101..15k.
 *  0b0110..17.5k.
 *  0b0111..20k.
 *  0b1000..22.5k.
 *  0b1001..25k.
 *  0b1010..27.5k.
 *  0b1011..30k.
 *  0b1100..32.5k.
 *  0b1101..35k.
 *  0b1110..37.5k.
 *  0b1111..40k.
 */
#define TSI_MUL0_M_SEN_RES(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_SEN_RES_SHIFT)) & TSI_MUL0_M_SEN_RES_MASK)

#define TSI_MUL0_M_PRE_RES_MASK                  (0xE000U)
#define TSI_MUL0_M_PRE_RES_SHIFT                 (13U)
/*! M_PRE_RES - M_PRE_RES
 *  0b000..1k.
 *  0b001..2k.
 *  0b010..3k.
 *  0b011..4k.
 *  0b100..5k.
 *  0b101..6k.
 *  0b110..7k.
 *  0b111..8k.
 */
#define TSI_MUL0_M_PRE_RES(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_PRE_RES_SHIFT)) & TSI_MUL0_M_PRE_RES_MASK)

#define TSI_MUL0_M_TX_USED_MASK                  (0x3F0000U)
#define TSI_MUL0_M_TX_USED_SHIFT                 (16U)
/*! M_TX_USED - M_TX_USED
 */
#define TSI_MUL0_M_TX_USED(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_TX_USED_SHIFT)) & TSI_MUL0_M_TX_USED_MASK)

#define TSI_MUL0_M_PRE_CURRENT_MASK              (0xE0000000U)
#define TSI_MUL0_M_PRE_CURRENT_SHIFT             (29U)
/*! M_PRE_CURRENT - M_PRE_CURRENT
 *  0b000..1uA.
 *  0b001..2uA.
 *  0b010..3uA.
 *  0b011..4uA.
 *  0b100..5uA.
 *  0b101..6uA.
 *  0b110..7uA.
 *  0b111..8uA.
 */
#define TSI_MUL0_M_PRE_CURRENT(x)                (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_PRE_CURRENT_SHIFT)) & TSI_MUL0_M_PRE_CURRENT_MASK)
/*! @} */

/*! @name MUL1 - TSI MUTUAL-CAP Register 1 */
/*! @{ */

